/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include <d3d9.h>
#include <d3dx9.h>
#include "texture.h"
#include "sprite.h"
#include "common.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/

/*******************************************************************************
* 構造体定義
*******************************************************************************/

/*******************************************************************************
* グローバル変数
*******************************************************************************/
static int g_Texture;
static float g_scroll;


void Background_Init(void)
{
	g_Texture = Texture_SetLoadFile("./sozai/img/background01.png", 800, 1600);
	g_scroll = 0;
}
void Background_Uninit(void)
{
	Texture_Destroy(&g_Texture, 1);
}
void Background_Update(void)
{
	g_scroll--;
	
}
void Background_Draw(void)
{
	Sprite_DrawCut(g_Texture, 400, 450, 0, g_scroll * 0.5f, 800, 900);
}